dferbas/ethernut/nut/include/arch/cm3/stm/generated/stm32l162xe_pinmux.h
# define PINMUX(gpio, func) ((gpio == PIN_NONE) ? AF_PIN_NONE : 	\
	((gpio == PA00) && (func == RTC_TAMP2_FUNC           )) ?  0 : \
	((gpio == PA00) && (func == SYS_WKUP1_FUNC           )) ?  0 : \
	((gpio == PA00) && (func == TIM2_CH1_FUNC            )) ?  1 : \
	((gpio == PA00) && (func == TIM5_CH1_FUNC            )) ?  2 : \
	((gpio == PA00) && (func == USART2_CTS_FUNC          )) ?  7 : \
	((gpio == PA00) && (func == COMP1_INP_FUNC           )) ? 14 : \
	((gpio == PA00) && (func == TIMX_IC1_FUNC            )) ? 14 : \
	((gpio == PA00) && (func == TS_G1_IO1_FUNC           )) ? 14 : \
	((gpio == PA01) && (func == TIM2_CH2_FUNC            )) ?  1 : \
	((gpio == PA01) && (func == TIM5_CH2_FUNC            )) ?  2 : \
	((gpio == PA01) && (func == USART2_RTS_FUNC          )) ?  7 : \
	((gpio == PA01) && (func == LCD_SEG0_FUNC            )) ? 11 : \
	((gpio == PA01) && (func == COMP1_INP_FUNC           )) ? 14 : \
	((gpio == PA01) && (func == TIMX_IC2_FUNC            )) ? 14 : \
	((gpio == PA01) && (func == TS_G1_IO2_FUNC           )) ? 14 : \
	((gpio == PA02) && (func == TIM2_CH3_FUNC            )) ?  1 : \
	((gpio == PA02) && (func == TIM5_CH3_FUNC            )) ?  2 : \
	((gpio == PA02) && (func == TIM9_CH1_FUNC            )) ?  3 : \
	((gpio == PA02) && (func == USART2_TX_FUNC           )) ?  7 : \
	((gpio == PA02) && (func == LCD_SEG1_FUNC            )) ? 11 : \
	((gpio == PA02) && (func == COMP1_INP_FUNC           )) ? 14 : \
	((gpio == PA02) && (func == TIMX_IC3_FUNC            )) ? 14 : \
	((gpio == PA02) && (func == TS_G1_IO3_FUNC           )) ? 14 : \
	((gpio == PA03) && (func == TIM2_CH4_FUNC            )) ?  1 : \
	((gpio == PA03) && (func == TIM5_CH4_FUNC            )) ?  2 : \
	((gpio == PA03) && (func == TIM9_CH2_FUNC            )) ?  3 : \
	((gpio == PA03) && (func == USART2_RX_FUNC           )) ?  7 : \
	((gpio == PA03) && (func == LCD_SEG2_FUNC            )) ? 11 : \
	((gpio == PA03) && (func == COMP1_INP_FUNC           )) ? 14 : \
	((gpio == PA03) && (func == TIMX_IC4_FUNC            )) ? 14 : \
	((gpio == PA03) && (func == TS_G1_IO4_FUNC           )) ? 14 : \
	((gpio == PA04) && (func == SPI1_NSS_FUNC            )) ?  5 : \
	((gpio == PA04) && (func == I2S3_WS_FUNC             )) ?  6 : \
	((gpio == PA04) && (func == SPI3_NSS_FUNC            )) ?  6 : \
	((gpio == PA04) && (func == USART2_CK_FUNC           )) ?  7 : \
	((gpio == PA04) && (func == COMP1_INP_FUNC           )) ? 14 : \
	((gpio == PA04) && (func == TIMX_IC1_FUNC            )) ? 14 : \
	((gpio == PA05) && (func == TIM2_CH1_FUNC            )) ?  1 : \
	((gpio == PA05) && (func == SPI1_SCK_FUNC            )) ?  5 : \
	((gpio == PA05) && (func == COMP1_INP_FUNC           )) ? 14 : \
	((gpio == PA05) && (func == TIMX_IC2_FUNC            )) ? 14 : \
	((gpio == PA06) && (func == TIM3_CH1_FUNC            )) ?  2 : \
	((gpio == PA06) && (func == TIM10_CH1_FUNC           )) ?  3 : \
	((gpio == PA06) && (func == SPI1_MISO_FUNC           )) ?  5 : \
	((gpio == PA06) && (func == LCD_SEG3_FUNC            )) ? 11 : \
	((gpio == PA06) && (func == COMP1_INP_FUNC           )) ? 14 : \
	((gpio == PA06) && (func == TIMX_IC3_FUNC            )) ? 14 : \
	((gpio == PA06) && (func == TS_G2_IO1_FUNC           )) ? 14 : \
	((gpio == PA07) && (func == TIM3_CH2_FUNC            )) ?  2 : \
	((gpio == PA07) && (func == TIM11_CH1_FUNC           )) ?  3 : \
	((gpio == PA07) && (func == SPI1_MOSI_FUNC           )) ?  5 : \
	((gpio == PA07) && (func == LCD_SEG4_FUNC            )) ? 11 : \
	((gpio == PA07) && (func == COMP1_INP_FUNC           )) ? 14 : \
	((gpio == PA07) && (func == TIMX_IC4_FUNC            )) ? 14 : \
	((gpio == PA07) && (func == TS_G2_IO2_FUNC           )) ? 14 : \
	((gpio == PA08) && (func == RCC_MCO_FUNC             )) ?  0 : \
	((gpio == PA08) && (func == USART1_CK_FUNC           )) ?  7 : \
	((gpio == PA08) && (func == LCD_COM0_FUNC            )) ? 11 : \
	((gpio == PA08) && (func == TIMX_IC1_FUNC            )) ? 14 : \
	((gpio == PA08) && (func == TS_G4_IO1_FUNC           )) ? 14 : \
	((gpio == PA09) && (func == USART1_TX_FUNC           )) ?  7 : \
	((gpio == PA09) && (func == LCD_COM1_FUNC            )) ? 11 : \
	((gpio == PA09) && (func == TIMX_IC2_FUNC            )) ? 14 : \
	((gpio == PA09) && (func == TS_G4_IO2_FUNC           )) ? 14 : \
	((gpio == PA10) && (func == USART1_RX_FUNC           )) ?  7 : \
	((gpio == PA10) && (func == LCD_COM2_FUNC            )) ? 11 : \
	((gpio == PA10) && (func == TIMX_IC3_FUNC            )) ? 14 : \
	((gpio == PA10) && (func == TS_G4_IO3_FUNC           )) ? 14 : \
	((gpio == PA11) && (func == SPI1_MISO_FUNC           )) ?  5 : \
	((gpio == PA11) && (func == USART1_CTS_FUNC          )) ?  7 : \
	((gpio == PA11) && (func == USB_DM_FUNC              )) ? 10 : \
	((gpio == PA11) && (func == TIMX_IC4_FUNC            )) ? 14 : \
	((gpio == PA12) && (func == SPI1_MOSI_FUNC           )) ?  5 : \
	((gpio == PA12) && (func == USART1_RTS_FUNC          )) ?  7 : \
	((gpio == PA12) && (func == USB_DP_FUNC              )) ? 10 : \
	((gpio == PA12) && (func == TIMX_IC1_FUNC            )) ? 14 : \
	((gpio == PA13) && (func == SYS_JTMS_SWDIO_FUNC      )) ?  0 : \
	((gpio == PA13) && (func == TIMX_IC2_FUNC            )) ? 14 : \
	((gpio == PA13) && (func == TS_G5_IO1_FUNC           )) ? 14 : \
	((gpio == PA14) && (func == SYS_JTCK_SWCLK_FUNC      )) ?  0 : \
	((gpio == PA14) && (func == TIMX_IC3_FUNC            )) ? 14 : \
	((gpio == PA14) && (func == TS_G5_IO2_FUNC           )) ? 14 : \
	((gpio == PA15) && (func == SYS_JTDI_FUNC            )) ?  0 : \
	((gpio == PA15) && (func == TIM2_CH1_FUNC            )) ?  1 : \
	((gpio == PA15) && (func == SPI1_NSS_FUNC            )) ?  5 : \
	((gpio == PA15) && (func == I2S3_WS_FUNC             )) ?  6 : \
	((gpio == PA15) && (func == SPI3_NSS_FUNC            )) ?  6 : \
	((gpio == PA15) && (func == LCD_SEG17_FUNC           )) ? 11 : \
	((gpio == PA15) && (func == TIMX_IC4_FUNC            )) ? 14 : \
	((gpio == PA15) && (func == TS_G5_IO3_FUNC           )) ? 14 : \
	((gpio == PB00) && (func == V_REF_OUT_FUNC           )) ?  0 : \
	((gpio == PB00) && (func == TIM3_CH3_FUNC            )) ?  2 : \
	((gpio == PB00) && (func == LCD_SEG5_FUNC            )) ? 11 : \
	((gpio == PB00) && (func == COMP1_INP_FUNC           )) ? 14 : \
	((gpio == PB00) && (func == SYS_V_REF_OUT_FUNC       )) ? 14 : \
	((gpio == PB00) && (func == TS_G3_IO1_FUNC           )) ? 14 : \
	((gpio == PB01) && (func == V_REF_OUT_FUNC           )) ?  0 : \
	((gpio == PB01) && (func == TIM3_CH4_FUNC            )) ?  2 : \
	((gpio == PB01) && (func == LCD_SEG6_FUNC            )) ? 11 : \
	((gpio == PB01) && (func == COMP1_INP_FUNC           )) ? 14 : \
	((gpio == PB01) && (func == SYS_V_REF_OUT_FUNC       )) ? 14 : \
	((gpio == PB01) && (func == TS_G3_IO2_FUNC           )) ? 14 : \
	((gpio == PB02) && (func == TS_G3_IO3_FUNC           )) ? 14 : \
	((gpio == PB03) && (func == SYS_JTDO_TRACESWO_FUNC   )) ?  0 : \
	((gpio == PB03) && (func == TIM2_CH2_FUNC            )) ?  1 : \
	((gpio == PB03) && (func == SPI1_SCK_FUNC            )) ?  5 : \
	((gpio == PB03) && (func == I2S3_CK_FUNC             )) ?  6 : \
	((gpio == PB03) && (func == SPI3_SCK_FUNC            )) ?  6 : \
	((gpio == PB03) && (func == LCD_SEG7_FUNC            )) ? 11 : \
	((gpio == PB03) && (func == COMP2_INM_FUNC           )) ? 14 : \
	((gpio == PB04) && (func == SYS_JTRST_FUNC           )) ?  0 : \
	((gpio == PB04) && (func == TIM3_CH1_FUNC            )) ?  2 : \
	((gpio == PB04) && (func == SPI1_MISO_FUNC           )) ?  5 : \
	((gpio == PB04) && (func == SPI3_MISO_FUNC           )) ?  6 : \
	((gpio == PB04) && (func == LCD_SEG8_FUNC            )) ? 11 : \
	((gpio == PB04) && (func == COMP2_INP_FUNC           )) ? 14 : \
	((gpio == PB04) && (func == TS_G6_IO1_FUNC           )) ? 14 : \
	((gpio == PB05) && (func == TIM3_CH2_FUNC            )) ?  2 : \
	((gpio == PB05) && (func == I2C1_SMBA_FUNC           )) ?  4 : \
	((gpio == PB05) && (func == SPI1_MOSI_FUNC           )) ?  5 : \
	((gpio == PB05) && (func == I2S3_SD_FUNC             )) ?  6 : \
	((gpio == PB05) && (func == SPI3_MOSI_FUNC           )) ?  6 : \
	((gpio == PB05) && (func == LCD_SEG9_FUNC            )) ? 11 : \
	((gpio == PB05) && (func == COMP2_INP_FUNC           )) ? 14 : \
	((gpio == PB05) && (func == TS_G6_IO2_FUNC           )) ? 14 : \
	((gpio == PB06) && (func == TIM4_CH1_FUNC            )) ?  2 : \
	((gpio == PB06) && (func == I2C1_SCL_FUNC            )) ?  4 : \
	((gpio == PB06) && (func == USART1_TX_FUNC           )) ?  7 : \
	((gpio == PB06) && (func == COMP2_INP_FUNC           )) ? 14 : \
	((gpio == PB06) && (func == TS_G6_IO3_FUNC           )) ? 14 : \
	((gpio == PB07) && (func == V_REF_PVD_IN_FUNC        )) ?  0 : \
	((gpio == PB07) && (func == TIM4_CH2_FUNC            )) ?  2 : \
	((gpio == PB07) && (func == I2C1_SDA_FUNC            )) ?  4 : \
	((gpio == PB07) && (func == USART1_RX_FUNC           )) ?  7 : \
	((gpio == PB07) && (func == COMP2_INP_FUNC           )) ? 14 : \
	((gpio == PB07) && (func == SYS_PVD_IN_FUNC          )) ? 14 : \
	((gpio == PB07) && (func == TS_G6_IO4_FUNC           )) ? 14 : \
	((gpio == PB08) && (func == TIM4_CH3_FUNC            )) ?  2 : \
	((gpio == PB08) && (func == TIM10_CH1_FUNC           )) ?  3 : \
	((gpio == PB08) && (func == I2C1_SCL_FUNC            )) ?  4 : \
	((gpio == PB08) && (func == LCD_SEG16_FUNC           )) ? 11 : \
	((gpio == PB09) && (func == TIM4_CH4_FUNC            )) ?  2 : \
	((gpio == PB09) && (func == TIM11_CH1_FUNC           )) ?  3 : \
	((gpio == PB09) && (func == I2C1_SDA_FUNC            )) ?  4 : \
	((gpio == PB09) && (func == LCD_COM3_FUNC            )) ? 11 : \
	((gpio == PB10) && (func == TIM2_CH3_FUNC            )) ?  1 : \
	((gpio == PB10) && (func == I2C2_SCL_FUNC            )) ?  4 : \
	((gpio == PB10) && (func == USART3_TX_FUNC           )) ?  7 : \
	((gpio == PB10) && (func == LCD_SEG10_FUNC           )) ? 11 : \
	((gpio == PB11) && (func == TIM2_CH4_FUNC            )) ?  1 : \
	((gpio == PB11) && (func == I2C2_SDA_FUNC            )) ?  4 : \
	((gpio == PB11) && (func == USART3_RX_FUNC           )) ?  7 : \
	((gpio == PB11) && (func == LCD_SEG11_FUNC           )) ? 11 : \
	((gpio == PB12) && (func == TIM10_CH1_FUNC           )) ?  3 : \
	((gpio == PB12) && (func == I2C2_SMBA_FUNC           )) ?  4 : \
	((gpio == PB12) && (func == I2S2_WS_FUNC             )) ?  5 : \
	((gpio == PB12) && (func == SPI2_NSS_FUNC            )) ?  5 : \
	((gpio == PB12) && (func == USART3_CK_FUNC           )) ?  7 : \
	((gpio == PB12) && (func == LCD_SEG12_FUNC           )) ? 11 : \
	((gpio == PB12) && (func == COMP1_INP_FUNC           )) ? 14 : \
	((gpio == PB12) && (func == TS_G7_IO1_FUNC           )) ? 14 : \
	((gpio == PB13) && (func == TIM9_CH1_FUNC            )) ?  3 : \
	((gpio == PB13) && (func == I2S2_CK_FUNC             )) ?  5 : \
	((gpio == PB13) && (func == SPI2_SCK_FUNC            )) ?  5 : \
	((gpio == PB13) && (func == USART3_CTS_FUNC          )) ?  7 : \
	((gpio == PB13) && (func == LCD_SEG13_FUNC           )) ? 11 : \
	((gpio == PB13) && (func == COMP1_INP_FUNC           )) ? 14 : \
	((gpio == PB13) && (func == TS_G7_IO2_FUNC           )) ? 14 : \
	((gpio == PB14) && (func == TIM9_CH2_FUNC            )) ?  3 : \
	((gpio == PB14) && (func == SPI2_MISO_FUNC           )) ?  5 : \
	((gpio == PB14) && (func == USART3_RTS_FUNC          )) ?  7 : \
	((gpio == PB14) && (func == LCD_SEG14_FUNC           )) ? 11 : \
	((gpio == PB14) && (func == COMP1_INP_FUNC           )) ? 14 : \
	((gpio == PB14) && (func == TS_G7_IO3_FUNC           )) ? 14 : \
	((gpio == PB15) && (func == RTC_REFIN_FUNC           )) ?  0 : \
	((gpio == PB15) && (func == TIM11_CH1_FUNC           )) ?  3 : \
	((gpio == PB15) && (func == I2S2_SD_FUNC             )) ?  5 : \
	((gpio == PB15) && (func == SPI2_MOSI_FUNC           )) ?  5 : \
	((gpio == PB15) && (func == LCD_SEG15_FUNC           )) ? 11 : \
	((gpio == PB15) && (func == COMP1_INP_FUNC           )) ? 14 : \
	((gpio == PB15) && (func == TS_G7_IO4_FUNC           )) ? 14 : \
	((gpio == PC00) && (func == LCD_SEG18_FUNC           )) ? 11 : \
	((gpio == PC00) && (func == COMP1_INP_FUNC           )) ? 14 : \
	((gpio == PC00) && (func == TIMX_IC1_FUNC            )) ? 14 : \
	((gpio == PC00) && (func == TS_G8_IO1_FUNC           )) ? 14 : \
	((gpio == PC01) && (func == LCD_SEG19_FUNC           )) ? 11 : \
	((gpio == PC01) && (func == COMP1_INP_FUNC           )) ? 14 : \
	((gpio == PC01) && (func == TIMX_IC2_FUNC            )) ? 14 : \
	((gpio == PC01) && (func == TS_G8_IO2_FUNC           )) ? 14 : \
	((gpio == PC02) && (func == LCD_SEG20_FUNC           )) ? 11 : \
	((gpio == PC02) && (func == COMP1_INP_FUNC           )) ? 14 : \
	((gpio == PC02) && (func == TIMX_IC3_FUNC            )) ? 14 : \
	((gpio == PC02) && (func == TS_G8_IO3_FUNC           )) ? 14 : \
	((gpio == PC03) && (func == LCD_SEG21_FUNC           )) ? 11 : \
	((gpio == PC03) && (func == COMP1_INP_FUNC           )) ? 14 : \
	((gpio == PC03) && (func == TIMX_IC4_FUNC            )) ? 14 : \
	((gpio == PC03) && (func == TS_G8_IO4_FUNC           )) ? 14 : \
	((gpio == PC04) && (func == LCD_SEG22_FUNC           )) ? 11 : \
	((gpio == PC04) && (func == COMP1_INP_FUNC           )) ? 14 : \
	((gpio == PC04) && (func == TIMX_IC1_FUNC            )) ? 14 : \
	((gpio == PC04) && (func == TS_G9_IO1_FUNC           )) ? 14 : \
	((gpio == PC05) && (func == LCD_SEG23_FUNC           )) ? 11 : \
	((gpio == PC05) && (func == COMP1_INP_FUNC           )) ? 14 : \
	((gpio == PC05) && (func == TIMX_IC2_FUNC            )) ? 14 : \
	((gpio == PC05) && (func == TS_G9_IO2_FUNC           )) ? 14 : \
	((gpio == PC06) && (func == TIM3_CH1_FUNC            )) ?  2 : \
	((gpio == PC06) && (func == I2S2_MCK_FUNC            )) ?  5 : \
	((gpio == PC06) && (func == LCD_SEG24_FUNC           )) ? 11 : \
	((gpio == PC06) && (func == TIMX_IC3_FUNC            )) ? 14 : \
	((gpio == PC06) && (func == TS_G10_IO1_FUNC          )) ? 14 : \
	((gpio == PC07) && (func == TIM3_CH2_FUNC            )) ?  2 : \
	((gpio == PC07) && (func == I2S3_MCK_FUNC            )) ?  6 : \
	((gpio == PC07) && (func == LCD_SEG25_FUNC           )) ? 11 : \
	((gpio == PC07) && (func == TIMX_IC4_FUNC            )) ? 14 : \
	((gpio == PC07) && (func == TS_G10_IO2_FUNC          )) ? 14 : \
	((gpio == PC08) && (func == TIM3_CH3_FUNC            )) ?  2 : \
	((gpio == PC08) && (func == LCD_SEG26_FUNC           )) ? 11 : \
	((gpio == PC08) && (func == TIMX_IC1_FUNC            )) ? 14 : \
	((gpio == PC08) && (func == TS_G10_IO3_FUNC          )) ? 14 : \
	((gpio == PC09) && (func == TIM3_CH4_FUNC            )) ?  2 : \
	((gpio == PC09) && (func == LCD_SEG27_FUNC           )) ? 11 : \
	((gpio == PC09) && (func == TIMX_IC2_FUNC            )) ? 14 : \
	((gpio == PC09) && (func == TS_G10_IO4_FUNC          )) ? 14 : \
	((gpio == PC10) && (func == I2S3_CK_FUNC             )) ?  6 : \
	((gpio == PC10) && (func == SPI3_SCK_FUNC            )) ?  6 : \
	((gpio == PC10) && (func == USART3_TX_FUNC           )) ?  7 : \
	((gpio == PC10) && (func == UART4_TX_FUNC            )) ?  8 : \
	((gpio == PC10) && (func == LCD_COM4_FUNC            )) ? 11 : \
	((gpio == PC10) && (func == LCD_SEG28_FUNC           )) ? 11 : \
	((gpio == PC10) && (func == LCD_SEG40_FUNC           )) ? 11 : \
	((gpio == PC10) && (func == TIMX_IC3_FUNC            )) ? 14 : \
	((gpio == PC11) && (func == SPI3_MISO_FUNC           )) ?  6 : \
	((gpio == PC11) && (func == USART3_RX_FUNC           )) ?  7 : \
	((gpio == PC11) && (func == UART4_RX_FUNC            )) ?  8 : \
	((gpio == PC11) && (func == LCD_COM5_FUNC            )) ? 11 : \
	((gpio == PC11) && (func == LCD_SEG29_FUNC           )) ? 11 : \
	((gpio == PC11) && (func == LCD_SEG41_FUNC           )) ? 11 : \
	((gpio == PC11) && (func == TIMX_IC4_FUNC            )) ? 14 : \
	((gpio == PC12) && (func == I2S3_SD_FUNC             )) ?  6 : \
	((gpio == PC12) && (func == SPI3_MOSI_FUNC           )) ?  6 : \
	((gpio == PC12) && (func == USART3_CK_FUNC           )) ?  7 : \
	((gpio == PC12) && (func == UART5_TX_FUNC            )) ?  8 : \
	((gpio == PC12) && (func == LCD_COM6_FUNC            )) ? 11 : \
	((gpio == PC12) && (func == LCD_SEG30_FUNC           )) ? 11 : \
	((gpio == PC12) && (func == LCD_SEG42_FUNC           )) ? 11 : \
	((gpio == PC12) && (func == TIMX_IC1_FUNC            )) ? 14 : \
	((gpio == PC13) && (func == RTC_OUT_ALARM_FUNC       )) ?  0 : \
	((gpio == PC13) && (func == RTC_OUT_CALIB_FUNC       )) ?  0 : \
	((gpio == PC13) && (func == RTC_TAMP1_FUNC           )) ?  0 : \
	((gpio == PC13) && (func == RTC_TS_FUNC              )) ?  0 : \
	((gpio == PC13) && (func == SYS_WKUP2_FUNC           )) ?  0 : \
	((gpio == PC13) && (func == TIMX_IC2_FUNC            )) ? 14 : \
	((gpio == PC14) && (func == RCC_OSC32_IN_FUNC        )) ?  0 : \
	((gpio == PC14) && (func == TIMX_IC3_FUNC            )) ? 14 : \
	((gpio == PC15) && (func == RCC_OSC32_OUT_FUNC       )) ?  0 : \
	((gpio == PC15) && (func == TIMX_IC4_FUNC            )) ? 14 : \
	((gpio == PD00) && (func == TIM9_CH1_FUNC            )) ?  3 : \
	((gpio == PD00) && (func == I2S2_WS_FUNC             )) ?  5 : \
	((gpio == PD00) && (func == SPI2_NSS_FUNC            )) ?  5 : \
	((gpio == PD00) && (func == TIMX_IC1_FUNC            )) ? 14 : \
	((gpio == PD01) && (func == I2S2_CK_FUNC             )) ?  5 : \
	((gpio == PD01) && (func == SPI2_SCK_FUNC            )) ?  5 : \
	((gpio == PD01) && (func == TIMX_IC2_FUNC            )) ? 14 : \
	((gpio == PD02) && (func == TIM3_ETR_FUNC            )) ?  2 : \
	((gpio == PD02) && (func == UART5_RX_FUNC            )) ?  8 : \
	((gpio == PD02) && (func == LCD_COM7_FUNC            )) ? 11 : \
	((gpio == PD02) && (func == LCD_SEG31_FUNC           )) ? 11 : \
	((gpio == PD02) && (func == LCD_SEG43_FUNC           )) ? 11 : \
	((gpio == PD02) && (func == TIMX_IC3_FUNC            )) ? 14 : \
	((gpio == PD03) && (func == SPI2_MISO_FUNC           )) ?  5 : \
	((gpio == PD03) && (func == USART2_CTS_FUNC          )) ?  7 : \
	((gpio == PD03) && (func == TIMX_IC4_FUNC            )) ? 14 : \
	((gpio == PD04) && (func == I2S2_SD_FUNC             )) ?  5 : \
	((gpio == PD04) && (func == SPI2_MOSI_FUNC           )) ?  5 : \
	((gpio == PD04) && (func == USART2_RTS_FUNC          )) ?  7 : \
	((gpio == PD04) && (func == TIMX_IC1_FUNC            )) ? 14 : \
	((gpio == PD05) && (func == USART2_TX_FUNC           )) ?  7 : \
	((gpio == PD05) && (func == TIMX_IC2_FUNC            )) ? 14 : \
	((gpio == PD06) && (func == USART2_RX_FUNC           )) ?  7 : \
	((gpio == PD06) && (func == TIMX_IC3_FUNC            )) ? 14 : \
	((gpio == PD07) && (func == TIM9_CH2_FUNC            )) ?  3 : \
	((gpio == PD07) && (func == USART2_CK_FUNC           )) ?  7 : \
	((gpio == PD07) && (func == TIMX_IC4_FUNC            )) ? 14 : \
	((gpio == PD08) && (func == USART3_TX_FUNC           )) ?  7 : \
	((gpio == PD08) && (func == LCD_SEG28_FUNC           )) ? 11 : \
	((gpio == PD08) && (func == TIMX_IC1_FUNC            )) ? 14 : \
	((gpio == PD09) && (func == USART3_RX_FUNC           )) ?  7 : \
	((gpio == PD09) && (func == LCD_SEG29_FUNC           )) ? 11 : \
	((gpio == PD09) && (func == TIMX_IC2_FUNC            )) ? 14 : \
	((gpio == PD10) && (func == USART3_CK_FUNC           )) ?  7 : \
	((gpio == PD10) && (func == LCD_SEG30_FUNC           )) ? 11 : \
	((gpio == PD10) && (func == TIMX_IC3_FUNC            )) ? 14 : \
	((gpio == PD11) && (func == USART3_CTS_FUNC          )) ?  7 : \
	((gpio == PD11) && (func == LCD_SEG31_FUNC           )) ? 11 : \
	((gpio == PD11) && (func == TIMX_IC4_FUNC            )) ? 14 : \
	((gpio == PD12) && (func == TIM4_CH1_FUNC            )) ?  2 : \
	((gpio == PD12) && (func == USART3_RTS_FUNC          )) ?  7 : \
	((gpio == PD12) && (func == LCD_SEG32_FUNC           )) ? 11 : \
	((gpio == PD12) && (func == TIMX_IC1_FUNC            )) ? 14 : \
	((gpio == PD13) && (func == TIM4_CH2_FUNC            )) ?  2 : \
	((gpio == PD13) && (func == LCD_SEG33_FUNC           )) ? 11 : \
	((gpio == PD13) && (func == TIMX_IC2_FUNC            )) ? 14 : \
	((gpio == PD14) && (func == TIM4_CH3_FUNC            )) ?  2 : \
	((gpio == PD14) && (func == LCD_SEG34_FUNC           )) ? 11 : \
	((gpio == PD14) && (func == TIMX_IC3_FUNC            )) ? 14 : \
	((gpio == PD15) && (func == TIM4_CH4_FUNC            )) ?  2 : \
	((gpio == PD15) && (func == LCD_SEG35_FUNC           )) ? 11 : \
	((gpio == PD15) && (func == TIMX_IC4_FUNC            )) ? 14 : \
	((gpio == PE00) && (func == TIM4_ETR_FUNC            )) ?  2 : \
	((gpio == PE00) && (func == TIM10_CH1_FUNC           )) ?  3 : \
	((gpio == PE00) && (func == LCD_SEG36_FUNC           )) ? 11 : \
	((gpio == PE00) && (func == TIMX_IC1_FUNC            )) ? 14 : \
	((gpio == PE01) && (func == TIM11_CH1_FUNC           )) ?  3 : \
	((gpio == PE01) && (func == LCD_SEG37_FUNC           )) ? 11 : \
	((gpio == PE01) && (func == TIMX_IC2_FUNC            )) ? 14 : \
	((gpio == PE02) && (func == SYS_TRACECK_FUNC         )) ?  0 : \
	((gpio == PE02) && (func == TIM3_ETR_FUNC            )) ?  2 : \
	((gpio == PE02) && (func == LCD_SEG38_FUNC           )) ? 11 : \
	((gpio == PE02) && (func == TIMX_IC3_FUNC            )) ? 14 : \
	((gpio == PE03) && (func == SYS_TRACED0_FUNC         )) ?  0 : \
	((gpio == PE03) && (func == TIM3_CH1_FUNC            )) ?  2 : \
	((gpio == PE03) && (func == LCD_SEG39_FUNC           )) ? 11 : \
	((gpio == PE03) && (func == TIMX_IC4_FUNC            )) ? 14 : \
	((gpio == PE04) && (func == SYS_TRACED1_FUNC         )) ?  0 : \
	((gpio == PE04) && (func == TIM3_CH2_FUNC            )) ?  2 : \
	((gpio == PE04) && (func == TIMX_IC1_FUNC            )) ? 14 : \
	((gpio == PE05) && (func == SYS_TRACED2_FUNC         )) ?  0 : \
	((gpio == PE05) && (func == TIM9_CH1_FUNC            )) ?  3 : \
	((gpio == PE05) && (func == TIMX_IC2_FUNC            )) ? 14 : \
	((gpio == PE06) && (func == RTC_TAMP3_FUNC           )) ?  0 : \
	((gpio == PE06) && (func == SYS_TRACED3_FUNC         )) ?  0 : \
	((gpio == PE06) && (func == SYS_WKUP3_FUNC           )) ?  0 : \
	((gpio == PE06) && (func == TIM9_CH2_FUNC            )) ?  3 : \
	((gpio == PE06) && (func == TIMX_IC3_FUNC            )) ? 14 : \
	((gpio == PE07) && (func == COMP1_INP_FUNC           )) ? 14 : \
	((gpio == PE07) && (func == TIMX_IC4_FUNC            )) ? 14 : \
	((gpio == PE08) && (func == COMP1_INP_FUNC           )) ? 14 : \
	((gpio == PE08) && (func == TIMX_IC1_FUNC            )) ? 14 : \
	((gpio == PE09) && (func == TIM2_CH1_FUNC            )) ?  1 : \
	((gpio == PE09) && (func == COMP1_INP_FUNC           )) ? 14 : \
	((gpio == PE09) && (func == TIMX_IC2_FUNC            )) ? 14 : \
	((gpio == PE10) && (func == TIM2_CH2_FUNC            )) ?  1 : \
	((gpio == PE10) && (func == COMP1_INP_FUNC           )) ? 14 : \
	((gpio == PE10) && (func == TIMX_IC3_FUNC            )) ? 14 : \
	((gpio == PE11) && (func == TIM2_CH3_FUNC            )) ?  1 : \
	((gpio == PE11) && (func == TIMX_IC4_FUNC            )) ? 14 : \
	((gpio == PE12) && (func == TIM2_CH4_FUNC            )) ?  1 : \
	((gpio == PE12) && (func == SPI1_NSS_FUNC            )) ?  5 : \
	((gpio == PE12) && (func == TIMX_IC1_FUNC            )) ? 14 : \
	((gpio == PE13) && (func == SPI1_SCK_FUNC            )) ?  5 : \
	((gpio == PE13) && (func == TIMX_IC2_FUNC            )) ? 14 : \
	((gpio == PE14) && (func == SPI1_MISO_FUNC           )) ?  5 : \
	((gpio == PE14) && (func == TIMX_IC3_FUNC            )) ? 14 : \
	((gpio == PE15) && (func == SPI1_MOSI_FUNC           )) ?  5 : \
	((gpio == PE15) && (func == TIMX_IC4_FUNC            )) ? 14 : \
	((gpio == PF06) && (func == TIM5_CH1_FUNC            )) ?  2 : \
	((gpio == PF06) && (func == COMP1_INP_FUNC           )) ? 14 : \
	((gpio == PF06) && (func == TS_G11_IO1_FUNC          )) ? 14 : \
	((gpio == PF07) && (func == TIM5_CH2_FUNC            )) ?  2 : \
	((gpio == PF07) && (func == COMP1_INP_FUNC           )) ? 14 : \
	((gpio == PF07) && (func == TS_G11_IO2_FUNC          )) ? 14 : \
	((gpio == PF08) && (func == TIM5_CH3_FUNC            )) ?  2 : \
