dferbas/ethernut/nut/include/arch/cm3/stm/generated/stm32l162xe_pinmux.h
	((gpio == PF08) && (func == COMP1_INP_FUNC           )) ? 14 : \
	((gpio == PF08) && (func == TS_G11_IO3_FUNC          )) ? 14 : \
	((gpio == PF09) && (func == TIM5_CH4_FUNC            )) ?  2 : \
	((gpio == PF09) && (func == COMP1_INP_FUNC           )) ? 14 : \
	((gpio == PF09) && (func == TS_G11_IO4_FUNC          )) ? 14 : \
	((gpio == PF10) && (func == COMP1_INP_FUNC           )) ? 14 : \
	((gpio == PF10) && (func == TS_G11_IO5_FUNC          )) ? 14 : \
	((gpio == PF11) && (func == TS_G3_IO4_FUNC           )) ? 14 : \
	((gpio == PF12) && (func == TS_G3_IO5_FUNC           )) ? 14 : \
	((gpio == PF13) && (func == TS_G9_IO3_FUNC           )) ? 14 : \
	((gpio == PF14) && (func == TS_G9_IO4_FUNC           )) ? 14 : \
	((gpio == PF15) && (func == TS_G2_IO3_FUNC           )) ? 14 : \
	((gpio == PG00) && (func == TS_G2_IO4_FUNC           )) ? 14 : \
	((gpio == PG01) && (func == TS_G2_IO5_FUNC           )) ? 14 : \
	((gpio == PG02) && (func == TS_G7_IO5_FUNC           )) ? 14 : \
	((gpio == PG03) && (func == TS_G7_IO6_FUNC           )) ? 14 : \
	((gpio == PG04) && (func == TS_G7_IO7_FUNC           )) ? 14 : \
	((gpio == PH00) && (func == RCC_OSC_IN_FUNC          )) ?  0 : \
	((gpio == PH01) && (func == RCC_OSC_OUT_FUNC         )) ?  0 : \
	AF_NO_SUCH_PINFUNC)

# define TIMERMUX(gpio, timer_nr, channel_nr) ((gpio == PIN_NONE) ? AF_PIN_NONE : 	\
	((gpio == PA00) && (timer_nr ==  2) && (channel_nr ==  1)) ?  1 : \
	((gpio == PA00) && (timer_nr ==  5) && (channel_nr ==  1)) ?  2 : \
	((gpio == PA01) && (timer_nr ==  2) && (channel_nr ==  2)) ?  1 : \
	((gpio == PA01) && (timer_nr ==  5) && (channel_nr ==  2)) ?  2 : \
	((gpio == PA02) && (timer_nr ==  2) && (channel_nr ==  3)) ?  1 : \
	((gpio == PA02) && (timer_nr ==  5) && (channel_nr ==  3)) ?  2 : \
	((gpio == PA02) && (timer_nr ==  9) && (channel_nr ==  1)) ?  3 : \
	((gpio == PA03) && (timer_nr ==  2) && (channel_nr ==  4)) ?  1 : \
	((gpio == PA03) && (timer_nr ==  5) && (channel_nr ==  4)) ?  2 : \
	((gpio == PA03) && (timer_nr ==  9) && (channel_nr ==  2)) ?  3 : \
	((gpio == PA05) && (timer_nr ==  2) && (channel_nr ==  1)) ?  1 : \
	((gpio == PA06) && (timer_nr ==  3) && (channel_nr ==  1)) ?  2 : \
	((gpio == PA06) && (timer_nr == 10) && (channel_nr ==  1)) ?  3 : \
	((gpio == PA07) && (timer_nr ==  3) && (channel_nr ==  2)) ?  2 : \
	((gpio == PA07) && (timer_nr == 11) && (channel_nr ==  1)) ?  3 : \
	((gpio == PA15) && (timer_nr ==  2) && (channel_nr ==  1)) ?  1 : \
	((gpio == PB00) && (timer_nr ==  3) && (channel_nr ==  3)) ?  2 : \
	((gpio == PB01) && (timer_nr ==  3) && (channel_nr ==  4)) ?  2 : \
	((gpio == PB03) && (timer_nr ==  2) && (channel_nr ==  2)) ?  1 : \
	((gpio == PB04) && (timer_nr ==  3) && (channel_nr ==  1)) ?  2 : \
	((gpio == PB05) && (timer_nr ==  3) && (channel_nr ==  2)) ?  2 : \
	((gpio == PB06) && (timer_nr ==  4) && (channel_nr ==  1)) ?  2 : \
	((gpio == PB07) && (timer_nr ==  4) && (channel_nr ==  2)) ?  2 : \
	((gpio == PB08) && (timer_nr ==  4) && (channel_nr ==  3)) ?  2 : \
	((gpio == PB08) && (timer_nr == 10) && (channel_nr ==  1)) ?  3 : \
	((gpio == PB09) && (timer_nr ==  4) && (channel_nr ==  4)) ?  2 : \
	((gpio == PB09) && (timer_nr == 11) && (channel_nr ==  1)) ?  3 : \
	((gpio == PB10) && (timer_nr ==  2) && (channel_nr ==  3)) ?  1 : \
	((gpio == PB11) && (timer_nr ==  2) && (channel_nr ==  4)) ?  1 : \
	((gpio == PB12) && (timer_nr == 10) && (channel_nr ==  1)) ?  3 : \
	((gpio == PB13) && (timer_nr ==  9) && (channel_nr ==  1)) ?  3 : \
	((gpio == PB14) && (timer_nr ==  9) && (channel_nr ==  2)) ?  3 : \
	((gpio == PB15) && (timer_nr == 11) && (channel_nr ==  1)) ?  3 : \
	((gpio == PC06) && (timer_nr ==  3) && (channel_nr ==  1)) ?  2 : \
	((gpio == PC07) && (timer_nr ==  3) && (channel_nr ==  2)) ?  2 : \
	((gpio == PC08) && (timer_nr ==  3) && (channel_nr ==  3)) ?  2 : \
	((gpio == PC09) && (timer_nr ==  3) && (channel_nr ==  4)) ?  2 : \
	((gpio == PD00) && (timer_nr ==  9) && (channel_nr ==  1)) ?  3 : \
	((gpio == PD07) && (timer_nr ==  9) && (channel_nr ==  2)) ?  3 : \
	((gpio == PD12) && (timer_nr ==  4) && (channel_nr ==  1)) ?  2 : \
	((gpio == PD13) && (timer_nr ==  4) && (channel_nr ==  2)) ?  2 : \
	((gpio == PD14) && (timer_nr ==  4) && (channel_nr ==  3)) ?  2 : \
	((gpio == PD15) && (timer_nr ==  4) && (channel_nr ==  4)) ?  2 : \
	((gpio == PE00) && (timer_nr == 10) && (channel_nr ==  1)) ?  3 : \
	((gpio == PE01) && (timer_nr == 11) && (channel_nr ==  1)) ?  3 : \
	((gpio == PE03) && (timer_nr ==  3) && (channel_nr ==  1)) ?  2 : \
	((gpio == PE04) && (timer_nr ==  3) && (channel_nr ==  2)) ?  2 : \
	((gpio == PE05) && (timer_nr ==  9) && (channel_nr ==  1)) ?  3 : \
	((gpio == PE06) && (timer_nr ==  9) && (channel_nr ==  2)) ?  3 : \
	((gpio == PE09) && (timer_nr ==  2) && (channel_nr ==  1)) ?  1 : \
	((gpio == PE10) && (timer_nr ==  2) && (channel_nr ==  2)) ?  1 : \
	((gpio == PE11) && (timer_nr ==  2) && (channel_nr ==  3)) ?  1 : \
	((gpio == PE12) && (timer_nr ==  2) && (channel_nr ==  4)) ?  1 : \
	((gpio == PF06) && (timer_nr ==  5) && (channel_nr ==  1)) ?  2 : \
	((gpio == PF07) && (timer_nr ==  5) && (channel_nr ==  2)) ?  2 : \
	((gpio == PF08) && (timer_nr ==  5) && (channel_nr ==  3)) ?  2 : \
	((gpio == PF09) && (timer_nr ==  5) && (channel_nr ==  4)) ?  2 : \
	AF_NO_SUCH_PINFUNC)
#endif
